CSI API ETABS v1
cGridSys.GetGridSysCartesian Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetGridSysCartesian(
	string Name,
	ref double Xo,
	ref double Yo,
	ref double RZ,
	ref bool StoryRangeIsDefault,
	ref string TopStory,
	ref string BottomStory,
	ref double BubbleSize,
	ref int GridColor,
	ref int NumXLines,
	ref string[] GridLineIDX,
	ref double[] OrdinateX,
	ref bool[] VisibleX,
	ref string[] BubbleLocX,
	ref int NumYLines,
	ref string[] GridLineIDY,
	ref double[] OrdinateY,
	ref bool[] VisibleY,
	ref string[] BubbleLocY,
	ref int NumGenLines,
	ref string[] GridLineIDGen,
	ref double[] GenOrdX1,
	ref double[] GenOrdY1,
	ref double[] GenOrdX2,
	ref double[] GenOrdY2,
	ref bool[] VisibleGen,
	ref string[] BubbleLocGen
)
Function GetGridSysCartesian (
	Name As String,
	ByRef Xo As Double,
	ByRef Yo As Double,
	ByRef RZ As Double,
	ByRef StoryRangeIsDefault As Boolean,
	ByRef TopStory As String,
	ByRef BottomStory As String,
	ByRef BubbleSize As Double,
	ByRef GridColor As Integer,
	ByRef NumXLines As Integer,
	ByRef GridLineIDX As String(),
	ByRef OrdinateX As Double(),
	ByRef VisibleX As Boolean(),
	ByRef BubbleLocX As String(),
	ByRef NumYLines As Integer,
	ByRef GridLineIDY As String(),
	ByRef OrdinateY As Double(),
	ByRef VisibleY As Boolean(),
	ByRef BubbleLocY As String(),
	ByRef NumGenLines As Integer,
	ByRef GridLineIDGen As String(),
	ByRef GenOrdX1 As Double(),
	ByRef GenOrdY1 As Double(),
	ByRef GenOrdX2 As Double(),
	ByRef GenOrdY2 As Double(),
	ByRef VisibleGen As Boolean(),
	ByRef BubbleLocGen As String()
) As Integer
Dim instance As cGridSys
Dim Name As String
Dim Xo As Double
Dim Yo As Double
Dim RZ As Double
Dim StoryRangeIsDefault As Boolean
Dim TopStory As String
Dim BottomStory As String
Dim BubbleSize As Double
Dim GridColor As Integer
Dim NumXLines As Integer
Dim GridLineIDX As String()
Dim OrdinateX As Double()
Dim VisibleX As Boolean()
Dim BubbleLocX As String()
Dim NumYLines As Integer
Dim GridLineIDY As String()
Dim OrdinateY As Double()
Dim VisibleY As Boolean()
Dim BubbleLocY As String()
Dim NumGenLines As Integer
Dim GridLineIDGen As String()
Dim GenOrdX1 As Double()
Dim GenOrdY1 As Double()
Dim GenOrdX2 As Double()
Dim GenOrdY2 As Double()
Dim VisibleGen As Boolean()
Dim BubbleLocGen As String()
Dim returnValue As Integer
returnValue = instance.GetGridSysCartesian(Name,
	Xo, Yo, RZ, StoryRangeIsDefault, TopStory,
	BottomStory, BubbleSize, GridColor,
	NumXLines, GridLineIDX, OrdinateX,
	VisibleX, BubbleLocX, NumYLines,
	GridLineIDY, OrdinateY, VisibleY,
	BubbleLocY, NumGenLines, GridLineIDGen,
	GenOrdX1, GenOrdY1, GenOrdX2, GenOrdY2,
	VisibleGen, BubbleLocGen)
int GetGridSysCartesian(
	String^ Name,
	double% Xo,
	double% Yo,
	double% RZ,
	bool% StoryRangeIsDefault,
	String^% TopStory,
	String^% BottomStory,
	double% BubbleSize,
	int% GridColor,
	int% NumXLines,
	array<String^>^% GridLineIDX,
	array<double>^% OrdinateX,
	array<bool>^% VisibleX,
	array<String^>^% BubbleLocX,
	int% NumYLines,
	array<String^>^% GridLineIDY,
	array<double>^% OrdinateY,
	array<bool>^% VisibleY,
	array<String^>^% BubbleLocY,
	int% NumGenLines,
	array<String^>^% GridLineIDGen,
	array<double>^% GenOrdX1,
	array<double>^% GenOrdY1,
	array<double>^% GenOrdX2,
	array<double>^% GenOrdY2,
	array<bool>^% VisibleGen,
	array<String^>^% BubbleLocGen
)
abstract GetGridSysCartesian :
        Name : string *
        Xo : float byref *
        Yo : float byref *
        RZ : float byref *
        StoryRangeIsDefault : bool byref *
        TopStory : string byref *
        BottomStory : string byref *
        BubbleSize : float byref *
        GridColor : int byref *
        NumXLines : int byref *
        GridLineIDX : string[] byref *
        OrdinateX : float[] byref *
        VisibleX : bool[] byref *
        BubbleLocX : string[] byref *
        NumYLines : int byref *
        GridLineIDY : string[] byref *
        OrdinateY : float[] byref *
        VisibleY : bool[] byref *
        BubbleLocY : string[] byref *
        NumGenLines : int byref *
        GridLineIDGen : string[] byref *
        GenOrdX1 : float[] byref *
        GenOrdY1 : float[] byref *
        GenOrdX2 : float[] byref *
        GenOrdY2 : float[] byref *
        VisibleGen : bool[] byref *
        BubbleLocGen : string[] byref -> int
Parameters
Name
Type: System.String
Xo
Type: System.Double
Yo
Type: System.Double
RZ
Type: System.Double
StoryRangeIsDefault
Type: System.Boolean
TopStory
Type: System.String
BottomStory
Type: System.String
BubbleSize
Type: System.Double
GridColor
Type: System.Int32
NumXLines
Type: System.Int32
GridLineIDX
Type: System.String[]
OrdinateX
Type: System.Double[]
VisibleX
Type: System.Boolean[]
BubbleLocX
Type: System.String[]
NumYLines
Type: System.Int32
GridLineIDY
Type: System.String[]
OrdinateY
Type: System.Double[]
VisibleY
Type: System.Boolean[]
BubbleLocY
Type: System.String[]
NumGenLines
Type: System.Int32
GridLineIDGen
Type: System.String[]
GenOrdX1
Type: System.Double[]
GenOrdY1
Type: System.Double[]
GenOrdX2
Type: System.Double[]
GenOrdY2
Type: System.Double[]
VisibleGen
Type: System.Boolean[]
BubbleLocGen
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cGridSys Interface
ETABSv1 Namespace